src/InformationRegisters/РА_НастройкиНачисленияБонусовПартнерам/РА_НастройкиНачисленияБонусовПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РА_НастройкиНачисленияБонусовПартнерам</name>
  <resources>
    <name>НастройкаБонуснойПрграммы</name>
    <type>
      <types>CatalogRef.РА_БонусныеПрограммы</types>
    </type>
  </resources>
  <resources>
    <name>ПоказательПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремииЗаПланЗакупок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремииЗаШоуРум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремииЗаСложныйПродукт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УидНастройки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриложенияКДоговору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриложенияКДоговору</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектНастройки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодДействия</name>
    <type>
      <types>CatalogRef.РА_ПериодыДействияБонуса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателяПлана</name>
    <type>
      <types>EnumRef.РА_ТипыПоказателяПлана</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/РА_КлючиАналитикиУчетаБонуснойПрограммы/РА_КлючиАналитикиУчетаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РА_КлючиАналитикиУчетаБонуснойПрограммы</name>
  <attributes>
    <name>ОбъектНастройки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>CatalogRef.РА_ПериодыДействияБонуса</types>
    </type>
  </attributes>
  <attributes>
    <name>УидБонуснойПрограммы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/РА_НастройкиНачисленияБонусовПартнерам/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
			
	Для Каждого ЗаписьНЗ Из ЭтотОбъект Цикл
		Справочники.РА_КлючиАналитикиУчетаБонуснойПрограммы.ПодобратьКлючАналитикиУчетаБонуснойПрограммы(ЗаписьНЗ.ОбъектНастройки, ЗаписьНз.ПериодДействия, ЗаписьНз.УидНастройки);	
	КонецЦикла;	
   
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	ЭтоПустойНабор = ЭтотОбъект.Количество() = 0;
	
	Если ЭтоПустойНабор Тогда
		ЭтотОбъект.Прочитать(); 
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() И ЭтоПустойНабор Тогда
		//Считаем, что это удаление записи	
		
		Для Каждого СтрокаЗаписи Из ЭтотОбъект Цикл
			НастройкаИспользуется = Справочники.РА_КлючиАналитикиУчетаБонуснойПрограммы.ПроверитьИспользованиеКлючаАналитикиУчетаБонуснойПрограммы(СтрокаЗаписи.УидНастройки);
			Если НастройкаИспользуется Тогда
				ОбщегоНазначения.СообщитьПользователю("По настройке бонусной программы есть движения в регистрах! Удаление невозможно!",,,,Отказ);
			Иначе
				Справочники.РА_КлючиАналитикиУчетаБонуснойПрограммы.ПометитьКлючАналитикиУчетаБонуснойПрограммыНаУдаление(СтрокаЗаписи.УидНастройки);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	//
КонецПроцедуры
